# Вы пользуетесь общественным транспортом?
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.

nuber = int(input("Введите номер вашего 6 значного билета для проверски Вашей удачи): "))

if 99999<nuber<=999999:
    array = str(nuber)
    firstTriad = int(array[0]) + int(array[1]) + int(array[2])
    secondTriad = int(array[3]) + int(array[4]) + int(array[5])
    result = bool(firstTriad == secondTriad)
    if result == True:
        print("Вы счастливчик!")
    else:
        print("Увы, не в этот раз...")
else:
    print("Подделка!!! Это фиаско, братан!")