# Вагоны в электричке пронумерованы натуральными
# числами, начиная с 1 (при этом иногда вагоны
# нумеруются от «головы» поезда, а иногда – с
# «хвоста»; это зависит от того, в какую сторону едет
# электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил,
# что его вагон имеет номер j. Он хочет определить,
# сколько всего вагонов в электричке. Напишите
# программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать
# невозможно.

x = int(input("Человек сел в какой по порядку вагон?: "))
y = int(input("Какой номер вагона написан?: "))

if x == y:
    print("Без дополнительных данных мы не можем решить данный вопрос")
else:
    print(f"Всего в поезде {x + y - 1} вагона")
