# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.

class1 = int(input("Сколько человек в первом классе "))
class2 = int(input("Сколько человек во втором классе "))
class3 = int(input("Сколько человек в третьем классе "))

# table = (class1//2+class1%2) + (class2//2+class2%2) + (class3//2+class3%2)
# или
table = ((class1+1)//2) + ((class2+1)//2) + ((class3+1)//2)
print(f"Наименьшее число парт для 3х классов: {table}")
