# Найдите сумму цифр трехзначного числа.

num = int(input("Введите целое трёхначное число: "))

if 100 <= num < 1000:
    print(f'Сумма каждой отдельной цыфры в числе {num} равна = {(num // 100) + (num // 10 % 10) + (num % 10)}')
else:
    print(f"Число {num} похоже на 3х значное число?")
    print("Подумай ещё...")

print("Второй вариант:")

if 100 <= num < 1000:
    arr = str(num)
    print(f'Сумма каждой отдельной цыфры в числе {num} равна = {int(arr[0]) + int(arr[1]) + int(arr[2])}')
else:
    print(f"Число {num} похоже на 3х значное число?")
    print("Подумай ещё...")
