# Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно,
# что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

origami = int(input("Сколько журавликов сделали дети? Поделись - "))

kate = (origami // 3) * 2
peter = (origami - kate) / 2
serhio = peter

print(f"Ну в таком случае Катя собрала - {int(kate)} Петя - {int(peter)} Сережа - {int(serhio)}")
