# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества.
# m — кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.

import random

n, m = int(input('Введите количество чисел в первом множестве: ')), \
    int(input('Введите количество чисел во втором множестве: '))
list_1 = [random.randint(1, 100) for i in range(n)]
list_2 = [random.randint(1, 100) for i in range(m)]
# # Если заполнять вручную
# list_2 = []
# for i in range(m):
#     list_2.append(int(input(f'Число {i + 1}: ')))
print(list_1)
print(list_2)

task_sets = set(list_2).union(set(list_1))
print(sorted(task_sets))
