# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

my_list = [1, 2, 2, 3, 4, 3, 6, 4, 5, 3, 9, 4, 6, 3, 2, 5, 7, 4, 1]
set_from_my_list = set(my_list)
print(len(set_from_my_list))
