# В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке,
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растёт N кустов. Эти кусты обладают разной урожайностью,
# поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.
import random

num_shrub = int(input("Напишите количество кустов: "))
harvest_shrub = [random.randint(25, 100) for i in range(num_shrub)]
print('На кустах обнаруженно', *harvest_shrub, 'ягод')
count_harvest = []
for i in range(num_shrub - 1):
    count_harvest.append(harvest_shrub[i - 1] + harvest_shrub[i] + harvest_shrub[i + 1])
count_harvest.append(harvest_shrub[-2] + harvest_shrub[-1] + harvest_shrub[0])
print(f'За один заход сборщик соберет максимум {max(count_harvest)} ягод')
